---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizes.Contains(System.Double)
source: html/041d076f-979f-6a91-854a-8e8e56f7a2fd.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizes.Contains Method

Checks whether a cable tray size with the nominal diameter exists.

## Syntax (C#)
```csharp
public bool Contains(
	double nominalDiameter
)
```

## Parameters
- **nominalDiameter** (`System.Double`) - Nominal diameter.

## Returns
True if a cable tray size with the nominal diameter exists.